#### StairsSupportTopsideSurfaceType Enumeration

---

|  |
| --- |
| See Also |

The style of the topside surface of the support.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsSupportTopsideSurfaceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsSupportTopsideSurfaceType ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsSupportTopsideSurfaceType ``` |

# Members

| Member name | Description |
| --- | --- |
| Closed | The style of the topside surface of the support is closed. |
| Open | The style of the topside surface of the support is open. |

# See Also

Autodesk.Revit.DB.Architecture Namespace